{
  "backend/main.mo": "Motoko canister defining core domain types (user profiles, heart rate readings, emergency alerts) and persistent storage with role-based access control. Implements APIs for managing user profiles, medical data, and emergency alerts with admin/user authorization checks.",
  "feature_evidence.json": "Feature evidence report mapping high-level product requirements (mobile-first UI, PWA support, mobile navigation, install help) to implemented frontend files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "Pre-generated JSON-style index summarizing frontend React components, pages, hooks, and their responsibilities for dashboards, alerts, profiles, layout, and mobile responsiveness.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color themes, light/dark mode variables, and base styles for the application UI.",
  "frontend/index.html": "Application HTML entry point configuring viewport, theme color, Apple PWA meta tags, icons, and linking the web app manifest and React entry script.",
  "frontend/public/manifest.webmanifest": "Progressive Web App manifest defining app identity, display mode, theme colors, orientation, start URL, and required icons including maskable assets.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes for landing, patient, control room, and alert detail pages, wrapped with AppShell, theme provider, and toaster notifications.",
  "frontend/src/components/Auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks control room permissions, explaining access restrictions and administrative bootstrapping steps.",
  "frontend/src/components/Auth/LoginButton.tsx": "Internet Identity authentication button handling sign-in/sign-out flows, loading states, and query cache clearing on logout.",
  "frontend/src/components/ControlRoom/AlertHistoryTable.tsx": "Renders a scrollable table showing the complete history of emergency alerts with severity, status, type, patient, and timestamp, fetched via a control room alerts hook. Supports loading/empty states and navigation to alert details.",
  "frontend/src/components/ControlRoom/AlertsQueueTable.tsx": "Displays the active/pending alerts queue in a table, auto-sorted by timestamp, highlighting severity and status for control room operators. Handles loading and empty states and links to alert actions.",
  "frontend/src/components/ControlRoom/AlertStatusActions.tsx": "Provides a card UI to update the status of a specific emergency alert using a select dropdown and mutation hook, with success/error toasts. Includes a brief guide explaining each alert status.",
  "frontend/src/components/ControlRoom/ControlRoomUserManagementCard.tsx": "Allows administrators to add new control room users by entering an Internet Identity principal ID and calling an access-control mutation. Includes validation, error handling, and bootstrapping information.",
  "frontend/src/components/Layout/AppHeader.tsx": "Defines the top application header with branding, navigation links, login button, and PWA install trigger. Navigation options are conditional on authentication and control room access.",
  "frontend/src/components/Layout/AppShell.tsx": "Wraps the application with a header, footer, and optional mobile bottom navigation, adjusting layout based on authentication state. Serves as the main layout container for all pages.",
  "frontend/src/components/Layout/MobileBottomNav.tsx": "Implements a fixed bottom navigation bar for mobile devices with Patient and conditional Control Room tabs. Highlights the active route and uses router navigation.",
  "frontend/src/components/Patient/AlertHistoryCard.tsx": "Displays the current user's alert history by fetching alerts, sorting them by timestamp, and rendering them in a responsive table or card layout with severity, status, type, and time formatting.",
  "frontend/src/components/Patient/MonitoringStatusCard.tsx": "Shows whether heart rate monitoring is active or inactive using the monitoring simulation hook, with status badges, icons, and explanatory text.",
  "frontend/src/components/Patient/ReadingsList.tsx": "Fetches and displays the last 10 heart rate readings for the logged-in user, sorted by time and labeled with status badges and timestamps.",
  "frontend/src/components/Patient/SimulationControlsCard.tsx": "Provides controls to start or stop heart rate monitoring simulation, display the latest reading, and configure low/high alert thresholds.",
  "frontend/src/components/Patient/SosButton.tsx": "Renders an emergency SOS card that lets the user manually trigger a high-severity alert with confirmation dialog and success/error notifications.",
  "frontend/src/components/Profile/ProfileEditorCard.tsx": "Allows users to view and edit their profile details, emergency contacts, and medical notes, and save changes via profile-related hooks with validation and toast feedback.",
  "frontend/src/components/Profile/ProfileSetupModal.tsx": "React modal component that collects and submits a user's basic profile, emergency contacts, and medical condition notes, saving them via a mutation hook and showing toast feedback.",
  "frontend/src/components/PWA/InstallHelpDialog.tsx": "Shows a modal dialog with step-by-step instructions for installing the app as a PWA on iOS and Android devices. Uses cards and icons to present platform-specific guidance.",
  "frontend/src/hooks/useAccessControl.ts": "Provides React Query hooks to check whether the current user is a control room user and to add a new control room user via backend actor calls.",
  "frontend/src/hooks/useActor.ts": "Central hook that creates and caches a backend actor based on the current Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useControlRoomAlerts.ts": "Collection of hooks for control-room users to fetch pending/all alerts, retrieve alert details and patient profiles, and update alert status with query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch the logged-in caller’s user profile and to save or update it along with emergency contacts and condition notes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider, managing login, logout, identity persistence, and authentication status using Dfinity AuthClient.",
  "frontend/src/hooks/useMonitoringSimulation.ts": "Simulates periodic heart rate readings, generates alerts when thresholds are exceeded, and writes readings and alerts to the backend while updating related queries.",
  "frontend/src/hooks/usePatientAlerts.ts": "Hooks for patients to fetch their own emergency alerts and to create new emergency alerts, with relevant cache invalidation.",
  "frontend/src/hooks/usePatientReadings.ts": "Hook to periodically fetch heart rate readings for a specified user principal from the backend.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining a medical-themed color system, light/dark variables, base styles, and utility classes for PWA safe areas and touch targets.",
  "frontend/src/main.tsx": "Frontend entry point that mounts the React app, wiring up React Query and Internet Identity providers and loading global styles.",
  "frontend/src/pages/ControlRoomAlertDetailPage.tsx": "Renders a detailed view of a single emergency alert for control room users, including patient info, alert metadata, and status actions. Handles authentication/authorization, loading states, and formatting of alert severity, status, and timestamps.",
  "frontend/src/pages/ControlRoomDashboardPage.tsx": "Main dashboard for authorized control room staff showing active alerts, alert history, and user management. Handles login, authorization checks, and tab-based navigation between alert views.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page describing the Cardiac Sentinel product with calls to action for patient and control room dashboards. Includes feature highlights, imagery, and a PWA install help dialog.",
  "frontend/src/pages/PatientDashboardPage.tsx": "Authenticated patient dashboard for monitoring heart data, triggering SOS alerts, viewing history, and managing profile information. Prompts profile setup for new users and organizes features into monitoring and profile tabs.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading URL parameters from query strings or hash routes and persisting them in sessionStorage. Includes functions to store, retrieve, clear, and sanitize URL/session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color system based on CSS variables, fonts, animations, and layout settings. Enables dark mode and registers typography, container queries, and animation plugins.",
  "project_state.json": "Defines the current project state, scope, and existing features for Cardiac Sentinel, including versioning, overall goal to expand from web dapp to mobile app, and a catalog of implemented features like authentication, RBAC, patient and control room dashboards, alerts, and app shell."
}