{
  "backend/main.mo": "Motoko canister implementing the backend domain for Cardiac Sentinel, including user profiles, heart rate readings, emergency alerts, and role-based access control. Provides query and update methods for patients and control-room admins with persistent storage.",
  "feature_evidence.json": "Structured report mapping product features to frontend files, shared components, and test requirements with confidence levels. Used to document feature coverage and traceability.",
  "frontend-file-summaries.txt": "Pre-generated index of frontend source files with concise descriptions of each component, page, and hook. Serves as documentation for frontend architecture and responsibilities.",
  "frontend/index.css": "Global Tailwind CSS setup defining design tokens, color themes, and light/dark mode variables. Applies base styles for layout, typography, and UI consistency.",
  "frontend/index.html": "HTML entry point for the React application, mounting the app to the root div and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router routes for landing, patient, and control room flows. Wraps the app with theme support and global toast notifications.",
  "frontend/src/components/Auth/AccessDeniedScreen.tsx": "UI screen shown when a user lacks permission to access the control room. Explains authorization requirements and provides bootstrapping guidance.",
  "frontend/src/components/Auth/LoginButton.tsx": "Authentication button handling Internet Identity sign-in and sign-out flows. Manages loading state, error recovery, and query cache clearing on logout.",
  "frontend/src/components/ControlRoom/AlertsQueueTable.tsx": "Renders a control room table of active emergency alerts fetched from the backend, sorted by timestamp with severity, status, and type badges. Provides loading/empty states and navigation actions for viewing individual alerts.",
  "frontend/src/components/ControlRoom/AlertStatusActions.tsx": "Control room component allowing authorized users to update an emergency alert’s status. Uses a dropdown selector, mutation hook, and toast feedback for success or failure.",
  "frontend/src/components/ControlRoom/ControlRoomUserManagementCard.tsx": "Provides a UI for administrators to add new control room users by Internet Identity principal ID. Handles validation, mutation state, and user feedback via toasts.",
  "frontend/src/components/Layout/AppHeader.tsx": "Implements the global application header with branding, authentication controls, and navigation buttons. Conditionally shows Patient and Control Room links based on authentication and access rights.",
  "frontend/src/components/Layout/AppShell.tsx": "Defines the main application layout with a sticky header, content area, and footer. Wraps all pages to ensure consistent structure and branding.",
  "frontend/src/components/Patient/MonitoringStatusCard.tsx": "Displays the current monitoring simulation status (active or inactive) for a patient. Uses visual indicators and descriptive text based on monitoring state.",
  "frontend/src/components/Patient/ReadingsList.tsx": "Shows the patient’s 10 most recent heart rate readings with timestamps and status badges. Fetches data per authenticated principal and handles loading and empty states.",
  "frontend/src/components/Patient/SimulationControlsCard.tsx": "Provides controls to start/stop heart rate monitoring simulation and configure alert thresholds. Displays the last reading and allows updating threshold values.",
  "frontend/src/components/Patient/SosButton.tsx": "Implements a prominent SOS emergency button for patients to manually trigger high-severity alerts. Includes confirmation dialog, backend mutation, and success/error feedback.",
  "frontend/src/components/Profile/ProfileEditorCard.tsx": "React card component that lets an authenticated user edit and save their profile, including basic info, emergency contacts, and condition notes, using profile hooks and showing toast feedback.",
  "frontend/src/components/Profile/ProfileSetupModal.tsx": "Modal dialog for first-time profile setup that collects basic info, emergency contacts, and condition notes, then saves the profile via a mutation with validation and toasts.",
  "frontend/src/hooks/useAccessControl.ts": "React Query hooks to check whether the current user is a control room user and to add a new control room user via backend actor calls.",
  "frontend/src/hooks/useActor.ts": "Central hook that creates and caches a backend actor based on Internet Identity, initializes access control, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useControlRoomAlerts.ts": "Hooks for control room workflows to fetch pending alerts, alert details, full patient profiles, and update alert status with query invalidation.",
  "frontend/src/hooks/useCurrentUserProfile.ts": "Hooks to fetch the caller’s user profile and to save profile data (including contacts and notes) while keeping the profile query in sync.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook that manage Internet Identity authentication state, login/logout, persisted identities, and login status flags.",
  "frontend/src/hooks/useMonitoringSimulation.ts": "Hook that simulates periodic heart rate readings, generates alerts when thresholds are exceeded, writes data to the backend, and invalidates related queries.",
  "frontend/src/hooks/usePatientAlerts.ts": "Mutation hook for patients to manually create emergency alerts and refresh related readings and alerts queries.",
  "frontend/src/hooks/usePatientReadings.ts": "Query hook to periodically fetch heart rate readings for a given patient principal from the backend actor.",
  "frontend/src/index.css": "Initializes Tailwind CSS layers and defines a medical-themed design system using CSS variables for light/dark modes, colors, radius, and charts.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/pages/ControlRoomAlertDetailPage.tsx": "Control room page for viewing detailed information about a specific emergency alert, including patient profile data, status, and actions, with access control enforced.",
  "frontend/src/pages/ControlRoomDashboardPage.tsx": "Main dashboard for authorized control room users showing the alerts queue and user management, with authentication and authorization checks.",
  "frontend/src/pages/LandingPage.tsx": "Public marketing landing page introducing Cardiac Sentinel, its features, and navigation links to patient and control room dashboards.",
  "frontend/src/pages/PatientDashboardPage.tsx": "Authenticated patient dashboard for monitoring heart data, managing profiles, triggering SOS alerts, and running simulations, with onboarding for new users.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters, supporting both query-string and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, color system based on CSS variables, typography, animations, and plugins for the frontend.",
  "project_state.json": "Defines the high-level design and requirements for the Cardiac Sentinel wearable and companion app, including patient and medical control room experiences. It lists existing features such as authentication, patient monitoring, SOS alerts, simulated sensor data, alert management, access control, and visual theming."
}