{
  "kind": "build_request",
  "title": "Start converting Cardiac Sentinel into a mobile-app-ready PWA experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Convert the existing Cardiac Sentinel web UI into a mobile-first, app-like experience: ensure all primary screens (Landing, Patient Dashboard, Control Room Dashboard, Alert Detail) are fully responsive on common phone widths, use touch-friendly spacing/sizing, and avoid desktop-only layout assumptions (e.g., multi-column sections collapsing cleanly to single column).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Convert this into a mobile app",
          "Get start to convert tha mobile app"
        ]
      },
      "acceptanceCriteria": [
        "On ~360px wide viewports, no horizontal scrolling occurs on Landing, Patient, Control Room, or Alert Detail pages",
        "All primary interactive controls (buttons, selects, table row actions) are comfortably tappable on mobile (no cramped click targets)",
        "Tables used on mobile (e.g., alert queues/history) remain usable via responsive patterns (e.g., stacked rows or horizontal scroll with clear affordance) without breaking layout"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add an installable PWA setup for Cardiac Sentinel so it can be added to a phone home screen and launched like an app: include a web app manifest, correct app icons, and required metadata in the HTML head (name, short name, theme color, display mode, start URL).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Convert this into a mobile app",
          "Get start to convert tha mobile app"
        ]
      },
      "acceptanceCriteria": [
        "The app includes a valid web app manifest referenced from the HTML entry point",
        "When opened in a mobile browser, the app is eligible for “Add to Home Screen” and launches in standalone/app-like mode after installation",
        "App icon displays correctly on the home screen using the provided generated icon assets"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add mobile-native navigation behavior: implement a bottom navigation pattern on small screens for authenticated users (Patient and, if authorized, Control Room), while keeping the existing desktop header navigation for larger screens.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6"
        ],
        "quotes": [
          "Convert this into a mobile app",
          "Get start to convert tha mobile app"
        ]
      },
      "acceptanceCriteria": [
        "On small screens, primary navigation is accessible via a bottom nav without requiring precision taps in the header",
        "Navigation options remain role-aware (Control Room entry only appears for control room users)",
        "On larger screens, the existing header-based navigation remains available and functional"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an in-app “Install” help surface (e.g., a lightweight card/modal reachable from the landing page and/or header) that explains in English how to install the app on iPhone (Safari) and Android (Chrome) using “Add to Home Screen.”",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-4"
        ],
        "quotes": [
          "How to download this app",
          "Convert this into a mobile app"
        ]
      },
      "acceptanceCriteria": [
        "Install instructions are written in English and clearly separated for iPhone and Android",
        "The help surface is accessible without authentication from the Landing page",
        "Instructions do not claim App Store / Play Store availability"
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn UI components are read-only); compose them instead.",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Backend remains single-actor Motoko; avoid introducing additional backend canisters or external services.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Building a native iOS/Android application package (App Store / Play Store submission) as part of this change",
    "Adding real device integrations (health sensors, SMS, GPS/location) as part of this change",
    "Changing authentication provider (Internet Identity remains the only auth method)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": [
      "Create a square app icon (frontend/public/assets/generated/cardiac-sentinel-logo.dim_512x512.png > frontend/public/assets/generated/app-icon.dim_192x192.png)",
      "Create a square app icon (frontend/public/assets/generated/cardiac-sentinel-logo.dim_512x512.png > frontend/public/assets/generated/app-icon.dim_512x512.png)",
      "Create an Apple touch icon (frontend/public/assets/generated/cardiac-sentinel-logo.dim_512x512.png > frontend/public/assets/generated/apple-touch-icon.dim_180x180.png)",
      "Create a maskable icon with safe padding (frontend/public/assets/generated/cardiac-sentinel-logo.dim_512x512.png > frontend/public/assets/generated/app-icon-maskable.dim_512x512.png)"
    ]
  }
}