{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Cardiac Sentinel mobile-first PWA + bottom navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Landing, Patient Dashboard, Control Room Dashboard, and Alert Detail pages mobile-first with touch-friendly spacing and responsive tables.",
      "acceptanceCriteria": [
        "On ~360px wide viewports, no horizontal scrolling occurs on Landing, Patient, Control Room, or Alert Detail pages",
        "All primary interactive controls (buttons, selects, table row actions) are comfortably tappable on mobile (no cramped click targets)",
        "Tables used on mobile (e.g., alert queues/history) remain usable via responsive patterns (e.g., stacked rows or horizontal scroll with clear affordance) without breaking layout"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add mobile/PWA layout helpers (e.g., safe-area padding utilities, consistent touch target minimums for key interactive elements, and overflow safeguards) to support a phone-width, app-like layout without horizontal scrolling."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Adjust the Landing page layout for small screens (tighten/stack hero grid, ensure images/cards do not overflow, and ensure primary CTAs are full-width or comfortably tappable on mobile)."
        },
        {
          "path": "frontend/src/pages/PatientDashboardPage.tsx",
          "operation": "modify",
          "description": "Refine Patient Dashboard mobile layout (ensure sections stack cleanly, tabs are usable on small widths, and spacing supports touch interaction)."
        },
        {
          "path": "frontend/src/pages/ControlRoomDashboardPage.tsx",
          "operation": "modify",
          "description": "Refine Control Room Dashboard mobile layout (tabs and tables remain usable; ensure content stacks and avoids desktop-only assumptions)."
        },
        {
          "path": "frontend/src/pages/ControlRoomAlertDetailPage.tsx",
          "operation": "modify",
          "description": "Ensure Alert Detail page is fully responsive on phone widths (avoid multi-column overflow, keep badges/actions readable and tappable, and ensure sticky elements do not cause horizontal scroll)."
        },
        {
          "path": "frontend/src/components/ControlRoom/AlertsQueueTable.tsx",
          "operation": "modify",
          "description": "Implement a mobile-friendly alert queue presentation: render a stacked-card list on small screens and keep the existing table for larger screens (or add a clearly-afforded horizontal scroll wrapper) to preserve usability without breaking layout."
        },
        {
          "path": "frontend/src/components/ControlRoom/AlertHistoryTable.tsx",
          "operation": "modify",
          "description": "Implement a mobile-friendly alert history presentation: render a stacked-card list on small screens and keep the existing table for larger screens (or add a clearly-afforded horizontal scroll wrapper) to preserve usability without breaking layout."
        },
        {
          "path": "frontend/src/components/Patient/AlertHistoryCard.tsx",
          "operation": "modify",
          "description": "Make the patient alert history usable on mobile by switching to a stacked-row/card pattern on small screens while retaining the table on larger screens, ensuring no horizontal overflow."
        },
        {
          "path": "frontend/src/components/ControlRoom/AlertStatusActions.tsx",
          "operation": "modify",
          "description": "Improve mobile touch ergonomics for status update controls (select + submit button) by ensuring comfortable spacing and tap targets on small screens."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add an installable PWA setup with manifest, metadata, and correct icons wired into the HTML entry point.",
      "acceptanceCriteria": [
        "The app includes a valid web app manifest referenced from the HTML entry point",
        "When opened in a mobile browser, the app is eligible for “Add to Home Screen” and launches in standalone/app-like mode after installation",
        "App icon displays correctly on the home screen using the provided generated icon assets"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Add required PWA metadata in the HTML head: manifest link, theme color, and icon references (including Apple touch icon) to support standalone install behavior."
        },
        {
          "path": "frontend/public/manifest.webmanifest",
          "operation": "create",
          "description": "Create a web app manifest defining name, short_name, start_url, display mode (standalone), theme_color/background_color, and icons that reference the generated app icon assets."
        },
        {
          "path": "frontend/public/assets/generated/app-icon.dim_192x192.png",
          "operation": "create",
          "description": "Add the generated PWA app icon asset at frontend/public/assets/generated/app-icon.dim_192x192.png (per imageRequirements edits) and ensure it is referenced by the manifest."
        },
        {
          "path": "frontend/public/assets/generated/app-icon.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated PWA app icon asset at frontend/public/assets/generated/app-icon.dim_512x512.png (per imageRequirements edits) and ensure it is referenced by the manifest."
        },
        {
          "path": "frontend/public/assets/generated/apple-touch-icon.dim_180x180.png",
          "operation": "create",
          "description": "Add the generated Apple touch icon at frontend/public/assets/generated/apple-touch-icon.dim_180x180.png (per imageRequirements edits) and ensure it is referenced by index.html."
        },
        {
          "path": "frontend/public/assets/generated/app-icon-maskable.dim_512x512.png",
          "operation": "create",
          "description": "Add the generated maskable icon at frontend/public/assets/generated/app-icon-maskable.dim_512x512.png (per imageRequirements edits) and ensure it is referenced by the manifest with purpose set to include maskable."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add mobile-native bottom navigation for authenticated users on small screens while preserving existing header navigation on larger screens, with role-aware Control Room visibility.",
      "acceptanceCriteria": [
        "On small screens, primary navigation is accessible via a bottom nav without requiring precision taps in the header",
        "Navigation options remain role-aware (Control Room entry only appears for control room users)",
        "On larger screens, the existing header-based navigation remains available and functional"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout/MobileBottomNav.tsx",
          "operation": "create",
          "description": "Create a small-screen bottom navigation component for authenticated users. Use the selected \"authorization\" component capability (role-based access control) via existing hooks to render role-aware items (e.g., only show Control Room when authorized). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Adjust header navigation so it remains the primary nav on larger screens but avoids cramped, precision-tap navigation on small screens (where bottom nav will be used). Keep role-aware behavior using the selected \"authorization\" component capability through existing hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout/AppShell.tsx",
          "operation": "modify",
          "description": "Wire MobileBottomNav into the global layout for small screens and authenticated users, and add appropriate bottom spacing/safe-area padding so page content does not sit behind the bottom nav."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Provide an in-app Install help surface accessible from the Landing page explaining Add to Home Screen steps for iPhone Safari and Android Chrome.",
      "acceptanceCriteria": [
        "Install instructions are written in English and clearly separated for iPhone and Android",
        "The help surface is accessible without authentication from the Landing page",
        "Instructions do not claim App Store / Play Store availability"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PWA/InstallHelpDialog.tsx",
          "operation": "create",
          "description": "Create a lightweight install help surface (dialog/modal or card) with English instructions separated for iPhone (Safari) and Android (Chrome), explicitly describing “Add to Home Screen” and not claiming App Store / Play Store availability. Compose existing shadcn/ui components (do not modify frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LandingPage.tsx",
          "operation": "modify",
          "description": "Add an unauthenticated entry point on the Landing page (e.g., button/link/card) that opens the InstallHelpDialog, ensuring it is easy to find and tappable on mobile. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/Layout/AppHeader.tsx",
          "operation": "modify",
          "description": "Optionally add a secondary access point in the header to open the InstallHelpDialog (kept unobtrusive on mobile where bottom nav is primary). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}